__author__='Рейтер Валерия Борисовна'

# 1. Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах.
# Формат вывода результата:
#
# до минуты: <s> сек;
# до часа: <m> мин <s> сек;
# до суток: <h> час <m> мин <s> сек;
# в остальных случаях: <d> дн <h> час <m> мин <s> сек.

duration = int(input('Введите длительность в секундах: '))

if 0 < duration < 60:
    s = duration
    print(s, 'сек')
elif 60 <= duration < 60 * 60:
    m = duration // 60
    s = duration % 60
    print(m, 'мин', s, 'сек')
elif 60 * 60 <= duration < 60 * 60 * 24:
    h = duration // (60 * 60)
    m = (duration % (60 * 60)) // 60
    s = (duration % (60 * 60)) % 60
    print(h, 'час', m, 'мин', s, ' сек')
else:
    d = duration // (60 * 60 * 24)
    h = (duration % (60 * 60 * 24)) // (60 * 60)
    m = ((duration % (60 * 60 * 24)) % (60 * 60)) // 60
    s = ((duration % (60 * 60 * 24)) % (60 * 60)) % 60
    print(d, 'дн', h, 'час', m, 'мин', s, ' сек')
